<?php

return [
    'type' => [
        'chain'  => 'オンチェーン送金',
        'wallet' => 'ウォレット送金',
        'bank'   => '銀行振込',
    ],
    'status' => [
        0 => '処理待ち',
        4 => '承認済み',
        5 => '異常',
    ],
    'direction' => [
        1  => '入金',
        -1 => '出金',
    ],
    'channel' => [
        'placeholder' => '-',
    ],
    'platform' => [
        1 => 'ウォレット送金',
        2 => '銀行振込',
    ],
    'platform_group' => [
        1 => '暗号資産',
        2 => '法定通貨',
    ],
    'deposit_status' => [
        'first_time' => '初回入金',
        'multiple'   => '複数回入金',
    ],
    'placeholder' => [
        'from'    => '-',
        'to'      => '-',
        'tx_hash' => '-',
        'network' => '-',
    ],
    'export' => [
        'title' => ['User ID', '入金元', '入金先', '注文番号', '三者注文番号', '入金タイプ', '支払チャネル', '入金通貨', '入金額', '実際の支払通貨', '実際の支払額', 'システムレート', '入金時間(GMT+0)', 'ハッシュ', 'ネットワーク', 'メールアドレス', '入金ステータス', 'ステータス'],
    ]
];
