<?php

return [
    'direction' => [
        'trade' => [
            0 => '買い',
            1 => '売り',
        ],
        'pending' => [
            2 => '買い指値',
            3 => '売り指値',
            4 => '買い逆指値',
            5 => '売り逆指値',
            -1 => '',
        ],
    ],
    'order_status' => [
        0 => 'いいえ',
        1 => 'はい',
    ],
    'close_type' => [
        -1 => '',
        0 => '手動決済',
        1 => '手動決済',
        2 => '管理者決済',
        3 => '損切り決済',
        4 => '利確決済',
        5 => '強制決済',
        9 => 'フォロー決済',
    ],
    'pending_status' => [
        0 => '注文中',
        1 => '約定済み',
        2 => '期限切れ',
        3 => '取消済み',
    ],
    'export' => [
        'trades' => [
            'headers' => ['ユーザーID', 'サブアカウントID', '口座タイプ', '注文番号', '銘柄', 'ロット', '証拠金モード', '方向', 'レバレッジ', '建玉時間(GMT+0)', '決済時間(GMT+0)', '建玉価格', '決済価格', '必要証拠金', '損益', '建玉/決済手数料', '資金調達料', '決済済み', '決済種別'],
        ],
        'pending_trades' => [
            'headers' => ['ユーザーID', 'サブアカウント', '注文番号', '銘柄', 'ロット', '証拠金モード', '売買方向', 'レバレッジ', '注文時間(GMT+0)', '有効期限(GMT+0)', '注文価格', '注文金額', '利確', '損切り', '注文状態'],
        ],
    ],
];
