<?php

return [

    'message' => [
        'not_empty' => 'ユーザーは空にできません',
        'wrong_options' => 'オプションが不正です',
        'account_error' => 'アカウント入力エラー',
        'not_exist' => '顧客が存在しません',
        'transfer_not_allowed' => 'ユーザーは一覧に表示されておらず、移管できません',
        'least_one' => '少なくとも1項目の情報を入力してください',
        'phone_not_exist' => '電話番号が存在しません',
        'unlocking_failed' => 'ロック解除に失敗しました',
        'select_file' => 'アップロードするファイルを選択してください',
        'transfer_is_not_allowed' => [
            0 => 'この顧客は一次代理店のため、移管できません',
            1 => '移管先の上位代理店は代理店ではないため、移管できません',
            2 => 'この代理店と移管先代理店は同一チェーン上にあるため、上位から下位への移管はできません',
            3 => 'この代理店は代理店階層パス内に存在しません',
            4 => '代理店階層が比較対象の階層で始まっていません',
        ],
    ],

    // 站内信
    'sys_message' => [
        'type_err' => 'メッセージタイプが存在しません',
        'message_empty' => 'タイトルと内容は空にできません',
        'type_empty' => 'メッセージタイプは空にできません',
        'user_not_empty' => 'ユーザーは空にできません',
        'area_required' => 'エリアを選択してください',
        'limit_exceeded' => 'アカウント数は10個以内です',
        'format_err' => 'メッセージ形式が不正です',
    ],

    // 账号类型
    'user_type' => [
        0 => '',
        1 => 'ホワイトリスト',
        2 => 'ブラックリスト',
    ],

    'white' => [
        'already' => 'ユーザーは既にホワイトリストに存在します',
        'not_in_list' => 'ユーザーはホワイトリストに存在しません',
    ],

    'black' => [
        'already_black' => 'ユーザーは既にブラックリストです',
    ],

    // 仅注册
    'status_registered' => '登録済み',

    // 是否
    'boolean' => [
        'yes' => 'はい',
        'no' => 'いいえ',
    ],

    'validation_status' => [
        1 => '正常',
        'unknown' => '不明',
    ],

    'bonus_status' => [
        1 => '利用可能',
        0 => '利用不可',
    ],

    // 是否入金
    'is_pay' => [
        0 => 'いいえ',
        1 => 'はい',
    ],

    // 注册方式
    'reg_way' => [
        'email' => 'メール登録',
        'wallet' => 'ウォレット登録',
        'unknown' => '登録方法が不明',
    ],

    // 登录方式
    'login_type' => [
        'email' => 'メールログイン',
        'wallet' => 'ウォレットログイン',
        'line' => 'LINEログイン',
        'telegram' => 'Telegramログイン',
        'apple' => 'Appleログイン',
        'google' => 'Googleログイン',
    ],

    // 真实账户
    'live_account' => 'リアル口座',

    // 账户类型-标准账户
    'standard_account' => '標準口座',

    // 邮箱验证状态
    'email_status' => [
        'unverified' => 'いいえ',
        'verified' => 'はい',
    ],

    // 客户消息类型
    'msg_type' => [
        'all' => 'すべての顧客',
        'select' => '指定顧客',
    ],

    // 账户类型
    'non_test_account' => '非テストアカウント',
    'test_account' => 'テストアカウント',

    'trade_account' => [
        'so_type' => [
            1 => '全倉',
            2 => '逐倉',
            'default' => '全倉',
        ],
        'position_mode' => [
            0 => '統合しない',
            1 => '一方方向',
            2 => '双方向',
        ],
    ],

    'export' => [
        'headers' => ['ユーザーID', 'ニックネーム', 'メールアドレス', '種別', '上位IB ID', '登録方法', 'ネットワーク', 'ウォレットアドレス', '入金有無', '登録日時'],
        'login_logs' => [
            'headers' => ['ログID', 'リクエストID', 'ユーザーID', '最新ログイン', 'IP', '国', 'User Agent', 'デバイス UUID', 'クライアントタイムゾーン', 'Canvas フィンガープリント Hash', 'Audio フィンガープリント Hash', '画面解像度', 'デバイス総合特性 Hash', 'ログイン方式', 'ログイン日時'],
        ],
        'white_list' => [
            'headers' => ['ユーザーID', 'ニックネーム', '種別', 'メールアドレス', '登録日時', '操作人', 'ホワイトリスト追加日時', '登録方法', '入金有無', 'ウォレットアドレス'],
        ],
        'black_list' => [
            'headers' => ['ユーザーID', '登録日時', 'ウォレットアドレス', 'メールアドレス', '操作人', 'ブラックリスト追加日時', '理由', '制限権限', '入金有無', '登録方法'],
        ],
    ],
];
