<?php

return [
    'status' => [
        0 => 'Ожидает публикации',
        1 => 'Опубликовано',
        2 => 'Аннулировано',
        'unknown' => 'Неизвестно',
    ],
    'publish_type' => [
        0 => 'По расписанию',
        1 => 'Вручную',
        'unknown' => 'Неизвестно',
    ],
    'message' => [
        'void_success' => 'Успешно аннулировано',
        'voided_no_action' => 'Мероприятие уже аннулировано, повторная операция невозможна.',
        'publish_success' => 'Успешно опубликовано',
        'only_pending_can_publish' => 'Опубликовать можно только мероприятия в статусе ожидания.',
        'activity_ended' => 'Мероприятие уже завершилось и не может быть опубликовано.',
    ],
];
