<?php

return [
    'type' => [
        'chain'  => 'Ончейн перевод',
        'wallet' => 'Перевод на кошелек',
        'bank'   => 'Банковский перевод',
    ],
    'status' => [
        0 => 'Ожидает обработки',
        4 => 'Одобрено',
        5 => 'Аномально',
    ],
    'direction' => [
        1  => 'Пополнение',
        -1 => 'Вывод',
    ],
    'channel' => [
        'placeholder' => '-',
    ],
    'platform' => [
        1 => 'Перевод на кошелек',
        2 => 'Банковский перевод',
    ],
    'platform_group' => [
        1 => 'Крипто',
        2 => 'Фиат',
    ],
    'placeholder' => [
        'from'    => '-',
        'to'      => '-',
        'tx_hash' => '-',
        'network' => '-',
    ],
    'export' => [
        'title' => ['ID пользователя', 'Источник пополнения', 'Назначение пополнения', 'Номер заказа', 'Сторонний номер заказа', 'Тип пополнения', 'Канал оплаты', 'Валюта пополнения', 'Сумма пополнения', 'Фактическая валюта оплаты', 'Фактическая сумма оплаты', 'Системный курс', 'Время пополнения (GMT+0)', 'Хеш', 'Сеть', 'Email', 'Статус'],
    ]
];
