<?php

return [
    'name_exists' => 'Название комиссии уже существует. Дубликаты: :details',
    'base_commission_rate_exists' => 'Базовая ставка комиссии уже существует. Текущая ставка :name: :rate%',
    'missing_listed_sources' => 'Некоторые активные инструменты не настроены',
    'review_status' => [
        0 => 'Черновик',
        1 => 'На рассмотрении',
        2 => 'Проверено',
        3 => 'Отклонено',
        4 => 'Отключено',
    ],
    'effective_status' => [
        0 => 'Не активно',
        1 => 'Активно',
    ],
];
