<?php

return [
    'login_empty'       => 'Имя пользователя или пароль не может быть пустым',
    'account_no'        => 'Имя пользователя или пароль неверны',
    'pwd_no'            => 'Имя пользователя или пароль неверны',
    'login_error'       => 'Проверка входа не удалась',
    'login_success'     => 'Вход выполнен успешно',
    'logout'            => 'Выход выполнен успешно',
    'key_empty'         => 'Ключ не может быть пустым',
    'captcha_not_empty' => 'Введите код подтверждения',
    'captcha_incorrect' => 'Код подтверждения неверен',
    'captcha_expired'   => 'Срок действия кода подтверждения истек, нажмите обновить и попробуйте снова',
];
