<?php

return [

    'message' => [
        'mobile_err'         => 'Неверный формат номера телефона',
        'email_err'          => 'Неверный формат email',
        'account_used'       => 'Связанный паспортный аккаунт уже используется',
        'user_not_exist'     => 'Пользователь не существует',
        'superior_not_exist' => 'Вышестоящий не существует',
    ],

    //用户
    'user'    => [
        'multi_field_not_empty' => 'Настоящее имя, пароль и роль не могут быть пустыми',
        'name_exists'           => 'Логин уже существует',
        'email_exist'           => 'Email уже существует',
        'phone_exist'           => 'Номер телефона уже существует',
        'email_error'           => 'Неверный формат email',
        'phone_error'           => 'Неверный формат номера телефона',
        'email_empty'           => 'Email не может быть пустым',
        'phone_empty'           => 'Номер телефона не может быть пустым',
        'least_one'             => 'Заполните хотя бы один пункт',
        'original_password_err' => 'Неверный текущий пароль',
    ],

    //角色菜单
    'role'    => [
        'name_not_empty'       => 'Название роли не может быть пустым',
        'name_too_lang'        => 'Название роли слишком длинное',
        'name_exist'           => 'Название роли уже существует',
        'superior_not_exist'   => 'Вышестоящий не существует',
        'permission_err'       => 'Неверный формат прав',
        'permission_not_empty' => 'Права на данные не могут быть пустыми',
        'non_superiors'        => 'Вышестоящий не существует',
        'unable_delete'        => 'В этой роли есть пользователи, удалить нельзя',
        'not_empty'            => 'Роль не может быть пустой',
    ],

    //菜单
    'menu'    => [
        'not_empty' => 'Меню не может быть пустым',
    ],

    'password' => [
        'not_empty'  => 'Пароль не может быть пустым',
        'consistent' => 'Новый пароль должен совпадать',
        'err'        => 'Текущий пароль неверен',
        'short'      => 'Длина пароля минимум 6 символов',
    ],

    'no_manager'     => 'Администратор отсутствует',

    'validate' => [
        'validation' => 'Сообщение об ошибке проверки',
        'password'   => 'Пароль должен содержать заглавные и строчные буквы, а также цифры, длина 8–24 символа',
    ],
];
