<?php

return [
    'direction' => [
        'trade' => [
            0 => 'Покупка',
            1 => 'Продажа',
        ],
        'pending' => [
            2 => 'Отложенная покупка',
            3 => 'Отложенная продажа',
            4 => 'Buy Stop',
            5 => 'Sell Stop',
            -1 => '',
        ],
    ],
    'order_status' => [
        0 => 'Нет',
        1 => 'Да',
    ],
    'close_type' => [
        -1 => '',
        0 => 'Ручное закрытие',
        1 => 'Ручное закрытие',
        2 => 'Закрытие администратором',
        3 => 'Стоп-лосс',
        4 => 'Тейк-профит',
        5 => 'Принудительное закрытие',
        9 => 'Закрытие по подписке',
    ],
    'pending_status' => [
        0 => 'В ожидании',
        1 => 'Исполнено',
        2 => 'Истекло',
        3 => 'Отменено',
    ],
    'export' => [
        'trades' => [
            'headers' => ['ID пользователя', 'ID субсчета', 'Тип счета', 'Номер ордера', 'Символ', 'Лоты', 'Режим маржи', 'Направление', 'Плечо', 'Время открытия (GMT+0)', 'Время закрытия (GMT+0)', 'Цена открытия', 'Цена закрытия', 'Маржа', 'Прибыль/Убыток', 'Комиссия открытия/закрытия', 'Фандинг', 'Закрыт', 'Тип закрытия'],
        ],
        'pending_trades' => [
            'headers' => ['ID пользователя', 'Субсчет', 'Номер ордера', 'Символ', 'Лоты', 'Режим маржи', 'Направление', 'Плечо', 'Время заявки (GMT+0)', 'Срок действия (GMT+0)', 'Цена заявки', 'Сумма заявки', 'Тейк-профит', 'Стоп-лосс', 'Статус заявки'],
        ],
    ],
];
