<?php

return [

    'message' => [
        'not_empty' => 'Пользователь не может быть пустым',
        'wrong_options' => 'Неверный вариант',
        'account_error' => 'Ошибка заполнения аккаунта',
        'not_exist' => 'Клиент не существует',
        'transfer_not_allowed' => 'Пользователь не отображается в списке и не может быть переведен',
        'least_one' => 'Заполните хотя бы один пункт информации',
        'phone_not_exist' => 'Номер телефона не существует',
        'unlocking_failed' => 'Разблокировка не удалась',
        'select_file' => 'Выберите файл для загрузки',
        'transfer_is_not_allowed' => [
            0 => 'Этот клиент является агентом первого уровня, перевод запрещен',
            1 => 'Целевой вышестоящий агент не является агентом, перевод запрещен',
            2 => 'Этот агент и целевой агент находятся в одной цепочке, перевод с более высокого уровня на более низкий запрещен',
            3 => 'Этот агент отсутствует в пути иерархии агентов',
            4 => 'Иерархия агентов не начинается со сравниваемого уровня',
        ],
    ],

    // 站内信
    'sys_message' => [
        'type_err' => 'Тип сообщения не существует',
        'message_empty' => 'Заголовок и содержание не могут быть пустыми',
        'type_empty' => 'Тип сообщения не может быть пустым',
        'user_not_empty' => 'Пользователь не может быть пустым',
        'area_required' => 'Выберите регион',
        'limit_exceeded' => 'Количество аккаунтов не более 10',
        'format_err' => 'Неверный формат сообщения',
    ],

    // 账号类型
    'user_type' => [
        0 => '',
        1 => 'Белый список',
        2 => 'Черный список',
    ],

    'white' => [
        'already' => 'Пользователь уже в белом списке',
        'not_in_list' => 'Пользователя нет в белом списке',
    ],

    'black' => [
        'already_black' => 'Пользователь уже в черном списке',
    ],

    // 仅注册
    'status_registered' => 'Зарегистрирован',

    // 是否
    'boolean' => [
        'yes' => 'Да',
        'no' => 'Нет',
    ],

    'validation_status' => [
        1 => 'Нормально',
        'unknown' => 'Неизвестно',
    ],

    'bonus_status' => [
        1 => 'Доступно',
        0 => 'Недоступно',
    ],

    // 是否入金
    'is_pay' => [
        0 => 'Нет',
        1 => 'Да',
    ],

    // 注册方式
    'reg_way' => [
        'email' => 'Регистрация по email',
        'wallet' => 'Регистрация через кошелек',
        'unknown' => 'Неизвестный способ регистрации',
    ],

    // 登录方式
    'login_type' => [
        'email' => 'Вход по email',
        'wallet' => 'Вход через кошелек',
        'line' => 'Вход через LINE',
        'telegram' => 'Вход через Telegram',
        'apple' => 'Вход через Apple',
        'google' => 'Вход через Google',
    ],

    // 真实账户
    'live_account' => 'Реальный аккаунт',

    // 账户类型-标准账户
    'standard_account' => 'Стандартный аккаунт',

    // 邮箱验证状态
    'email_status' => [
        'unverified' => 'Нет',
        'verified' => 'Да',
    ],

    // 客户消息类型
    'msg_type' => [
        'all' => 'Все клиенты',
        'select' => 'Выбранный клиент',
    ],

    // 账户类型
    'non_test_account' => 'Не тестовый аккаунт',
    'test_account' => 'Тестовый аккаунт',

    'trade_account' => [
        'so_type' => [
            1 => 'Кросс-маржа',
            2 => 'Изолированная маржа',
            'default' => 'Кросс-маржа',
        ],
        'position_mode' => [
            0 => 'Без объединения',
            1 => 'Неттинг',
            2 => 'Хеджирование',
        ],
    ],

    'export' => [
        'headers' => ['ID пользователя', 'Никнейм', 'Email', 'Тип', 'ID вышестоящего IB', 'Способ регистрации', 'Сеть', 'Адрес кошелька', 'Есть пополнение', 'Время регистрации'],
        'login_logs' => [
            'headers' => ['ID журнала', 'ID запроса', 'ID пользователя', 'Последний вход', 'IP', 'Страна', 'User Agent', 'UUID устройства', 'Часовой пояс клиента', 'Хеш Canvas-отпечатка', 'Хеш Audio-отпечатка', 'Разрешение экрана', 'Хеш комплексного отпечатка устройства', 'Тип входа', 'Время входа'],
        ],
        'white_list' => [
            'headers' => ['ID пользователя', 'Никнейм', 'Тип', 'Email', 'Время регистрации', 'Оператор', 'Время добавления в белый список', 'Способ регистрации', 'Есть пополнение', 'Адрес кошелька'],
        ],
        'black_list' => [
            'headers' => ['ID пользователя', 'Время регистрации', 'Адрес кошелька', 'Email', 'Оператор', 'Время добавления в черный список', 'Причина', 'Ограниченные права', 'Есть пополнение', 'Способ регистрации'],
        ],
    ],
];
