<?php

return [
    'direction' => [
        'trade' => [
            0 => '買',
            1 => '賣',
        ],
        'pending' => [
            2 => '掛單買入',
            3 => '掛單賣出',
            4 => '掛單追漲',
            5 => '掛單追空',
            -1 => '',
        ],
    ],
    'order_status' => [
        0 => '否',
        1 => '是',
    ],
    'close_type' => [
        -1 => '',
        0 => '手動平倉',
        1 => '手動平倉',
        2 => '後台平倉',
        3 => '止損平倉',
        4 => '止盈平倉',
        5 => '強制平倉',
        9 => '跟隨平倉',
    ],
    'pending_status' => [
        0 => '掛單中',
        1 => '掛單已成交',
        2 => '掛單已過期',
        3 => '掛單已取消',
    ],
    'export' => [
        'trades' => [
            'headers' => ['使用者ID', '子帳號ID', '帳號類型', '訂單號', '品種', '手數', '交易模式', '方向', '槓桿', '開倉時間(GMT+0)', '平倉時間(GMT+0)', '開倉價', '平倉價', '保證金', '盈虧', '開平倉費用', '資金費', '是否平倉', '平倉類型'],
        ],
        'pending_trades' => [
            'headers' => ['使用者ID', '子帳號', '訂單號', '品種', '手數', '交易模式', '買賣方向', '槓桿', '掛單時間(GMT+0)', '掛單有效時間(GMT+0)', '掛單價格', '委託金額', '止盈', '止損', '掛單狀態'],
        ],
    ],
];
