<?php

return [
    'direction' => [
        'trade' => [
            0 => '买',
            1 => '卖',
        ],
        'pending' => [
            2 => '挂单买入',
            3 => '挂单卖出',
            4 => '挂单追涨',
            5 => '挂单追空',
            -1 => '',
        ],
    ],
    'order_status' => [
        0 => '否',
        1 => '是',
    ],
    'close_type' => [
        -1 => '',
        0 => '手动平仓',
        1 => '手动平仓',
        2 => '后台平仓',
        3 => '止损平仓',
        4 => '止盈平仓',
        5 => '强制平仓',
        9 => '跟随平仓',
    ],
    'pending_status' => [
        0 => '挂单中',
        1 => '挂单已成交',
        2 => '挂单已过期',
        3 => '挂单已取消',
    ],
    'export' => [
        'trades' => [
            'headers' => ['用户ID', '子账号ID', '账号类型', '订单号', '品种', '手数', '交易模式', '方向', '杠杆', '开仓时间(GMT+0)', '平仓时间(GMT+0)', '开仓价', '平仓价', '保证金', '盈亏', '开平仓费用', '资金费', '是否平仓', '平仓类型'],
        ],
        'pending_trades' => [
            'headers' => ['用户ID', '子账号', '订单号', '品种', '手数', '交易模式', '买卖方向', '杠杆', '挂单时间(GMT+0)', '挂单有效时间(GMT+0)', '挂单价格', '委托金额', '止盈', '止损', '挂单状态'],
        ],
    ],
];
